Revit 2024 API
BuiltInFailures.DimensionFailures.DifferentLabelsInMultiSegmentDim Property
 All segments of a multi-segment dimension must be labeled the same.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DifferentLabelsInMultiSegmentDim { get; }
Visual Basic
Public Shared ReadOnly Property DifferentLabelsInMultiSegmentDim As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DifferentLabelsInMultiSegmentDim {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace